Element could not be cut by joined element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCutJoinedGeometry { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCutJoinedGeometry As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCutJoinedGeometry {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures JoinElementsFailures Class
  Autodesk.Revit.DB Namespace